Kozurofu-San/kozurofu-drivers/platforms/STM32F4/UsbDriver.h
#pragma once

#include "interface/Communication.h"
#include "interface/Timer.h"
#include <stdio.h>

#include "stm32f4xx.h"

namespace driver
{

    constexpr uint8_t loByte(uint16_t x) noexcept {
        return static_cast<uint8_t>(x & 0xFF);
    }
    
    constexpr uint8_t hiByte(uint16_t x) noexcept {
        return static_cast<uint8_t>((x >> 8) & 0xFF);
    }
    
class UsbDriver
{
    public:

    UsbDriver(USB_OTG_GlobalTypeDef* usb, ITimer &timer)
        : _usb(usb),
            _timer(timer)
    {}

    bool init()
    {
        __disable_irq ();
        device_state = DEVICE_STATE_DEFAULT;

        // Clock
        RCC->AHB2ENR |= RCC_AHB2ENR_OTGFSEN;

        _speed = HSE_VALUE
                * ((RCC->PLLCFGR & RCC_PLLCFGR_PLLN) >> RCC_PLLCFGR_PLLN_Pos)
                / ((RCC->PLLCFGR & RCC_PLLCFGR_PLLM) >> RCC_PLLCFGR_PLLM_Pos)
                / ((RCC->PLLCFGR & RCC_PLLCFGR_PLLQ) >> RCC_PLLCFGR_PLLQ_Pos);
                
        _usb->GAHBCFG = USB_OTG_GAHBCFG_GINT; // Enable Global Interrupt
    
        _usb->GINTMSK = USB_OTG_GINTMSK_USBRST |
                        // USB_OTG_GINTMSK_ENUMDNEM |
                        // USB_OTG_GINTMSK_SOFM   |
                        USB_OTG_GINTMSK_OEPINT |
                        USB_OTG_GINTMSK_IEPINT |
                        USB_OTG_GINTSTS_RXFLVL;
        
        _usb->GCCFG = USB_OTG_GCCFG_PWRDWN | USB_OTG_GCCFG_NOVBUSSENS; // Power up
        _dev->DCTL = USB_OTG_DCTL_SDIS;             // Soft disconnect
        _pwr = 0;
        _usb->GUSBCFG =  USB_OTG_GUSBCFG_FDMOD | USB_OTG_GUSBCFG_PHYSEL; // Force device mode
        _usb->GUSBCFG &= ~USB_OTG_GUSBCFG_TRDT;     // USB turnaround time
        _usb->GUSBCFG |= 0x6 << USB_OTG_GUSBCFG_TRDT_Pos;
        
        // FIFO sizes
        _usb->GRXFSIZ = RxFifoSize;     // All EPs RX FIFO RAM size
        _usb->DIEPTXF0_HNPTXFSIZ = (TxEp0FifoSize << USB_OTG_DIEPTXF_INEPTXFD_Pos) | (RxFifoSize << USB_OTG_DIEPTXF_INEPTXSA_Pos);
        _usb->DIEPTXF[Ep1 - 1] =   (TxEp1FifoSize) << USB_OTG_DIEPTXF_INEPTXFD_Pos | ((RxFifoSize + TxEp0FifoSize) << USB_OTG_DIEPTXF_INEPTXSA_Pos);
        _usb->DIEPTXF[Ep2 - 1] = 0;
        _usb->DIEPTXF[Ep3 - 1] = 0;
        // _usb->DIEPTXF[Ep2 - 1] =   ((TxEp2FifoSize) << USB_OTG_DIEPTXF_INEPTXFD_Pos) | (RxFifoSize+TxEp0FifoSize+TxEp1FifoSize);
        // _usb->DIEPTXF[Ep3 - 1] =   ((TxEp3FifoSize) << USB_OTG_DIEPTXF_INEPTXFD_Pos) | (RxFifoSize+TxEp0FifoSize+TxEp1FifoSize+TxEp2FifoSize); 
        for(uint32_t i = 1; i < 0x10 ; i++){
            USB_OTG_FS->DIEPTXF[i] = 0;
        }
        /* Init  EP0: 1 Packet, 3*8 bytes */
        epOut(Ep0)->DOEPTSIZ = 1 << USB_OTG_DOEPTSIZ_PKTCNT_Pos // This field is decremented to zero after a packet is written into the RxFIFO
            | CdcMaxPacketSize << USB_OTG_DOEPTSIZ_XFRSIZ_Pos   // Set in descriptor
            | USB_OTG_DOEPTSIZ_STUPCNT;                         // STUPCNT==0x11 means, EP can recieve 3 packets. RM says to set STUPCNT = 3
        epOut(Ep0)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA; // Clear NAK and enable EP0
    
        _dev->DCFG |= USB_OTG_DCFG_DSPD_Msk;    // Device speed - FS
        _usb->GINTSTS = 0xFFFFFFFF;             // Reset Global Interrupt status
        _dev->DCTL &= ~USB_OTG_DCTL_SDIS;       // Soft connect

        // Init EP
        for (uint32_t i = 0; i < EpCount; i++)
        {
            EndPoint[i].statusRx = EpReady;
            EndPoint[i].statusTx = EpReady;
            EndPoint[i].rxCounter = 0;
            EndPoint[i].txCounter = 0;
        }
        EndPoint[Ep0].rxBufferPtr = rxBufferEp0;     // RX Buffer for EP0
        EndPoint[Ep1].rxBufferPtr = rxBufferEp1;	  // RX Buffer for EP1

        // Interrupts
        NVIC_SetPriority(OTG_FS_IRQn, 6);
        NVIC_EnableIRQ(OTG_FS_IRQn);
        __enable_irq();

        _isInit = true;
        return true;
    }
    
    unsigned int cnt = 0;
    void interrupt()
    {
        // Reset
        if (_usb->GINTSTS & USB_OTG_GINTSTS_USBRST)
        {
            _usb->GINTSTS = USB_OTG_GINTSTS_USBRST;
            enumerateReset();
            printf("\nR");
            return;
        }

        // IN endpoint
        if (_usb->GINTSTS & USB_OTG_GINTSTS_IEPINT)
        {
            uint32_t epNums  = _dev->DAINT;             // Read out EndPoint INTerrupt bits
            
            if (epNums & (Ep0Mask << USB_OTG_DAINT_IEPINT_Pos))
            {
                uint16_t intr = epIn(Ep0)->DIEPINT;     // Read out EP interrupt bit
                printf("\nI0(%04X)", (unsigned int)intr);
                if(intr & USB_OTG_DIEPINT_XFRC)         // Transfer completed interrupt
                {
                    transferTxCallback(Ep0);            // Process TX transmission (if TX buffer is not empty)
                }
                epIn(Ep0)->DIEPINT = intr;
            }

            if (epNums & (Ep1Mask << USB_OTG_DAINT_IEPINT_Pos))
            {
                uint32_t intr = epIn(Ep1)->DIEPINT;
                printf("\nI1(%04X)", (unsigned int)intr);
                if (intr & USB_OTG_DIEPINT_XFRC)        // Transfer completed interrupt
                {
                    transferTxCallback(Ep1);			// Process TX transmission (if TX buffer is not empty)
                    epIn(Ep1)->DIEPINT = USB_OTG_DIEPINT_XFRC;	
                }
            }
            return;
        }
        
        // OUT endpoint
        if(_usb->GINTSTS & USB_OTG_GINTSTS_OEPINT)
        {
            uint32_t epNums  = _dev->DAINT;    // Read out EndPoint INTerrupt bits
            
            if (epNums & (Ep0Mask << USB_OTG_DAINT_OEPINT_Pos))
            {
                uint32_t intr = epOut(Ep0)->DOEPINT; // Read out Endpoint Interrupt register for EP0
                printf("\nO0(%04X)", (unsigned int)intr);
                if (intr & USB_OTG_DOEPINT_STUP)    // Setup packet recieved
                {
                    enumerate_Setup();
                }
                if (intr & USB_OTG_DOEPINT_XFRC)    // Transfer completed
                {
                    epOut(Ep0)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;    // CNAK and EPENA must be set again after every interrupt to let this EP recieve upcoming data
                }
                epOut(Ep0)->DOEPINT = intr;
            }

