Kozurofu-San/kozurofu-drivers/platforms/STM32F4/UsbDriver.h
    typedef enum
    {
        DEVICE_STATE_DEFAULT    = 0,
        DEVICE_STATE_RESET      = 1,
        DEVICE_STATE_ADDRESSED  = 2,
        DEVICE_STATE_LINECODED  = 4,
        DEVICE_STATE_TX_PR      = 8, /* TX transmission active */
    } eDeviceState;
    
    
    static constexpr inline USB_OTG_OUTEndpointTypeDef* epOut(uint32_t i)
    {
        return reinterpret_cast<USB_OTG_OUTEndpointTypeDef*>(
            USB_OTG_FS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE + (i * USB_OTG_EP_REG_SIZE));
    }
    
    static constexpr inline USB_OTG_INEndpointTypeDef* epIn(uint32_t i)
    {
        return reinterpret_cast<USB_OTG_INEndpointTypeDef*>(
            USB_OTG_FS_PERIPH_BASE + USB_OTG_IN_ENDPOINT_BASE + (i * USB_OTG_EP_REG_SIZE));
    }
    
    static constexpr inline uint32_t* fifo(uint32_t i)
    {
        return reinterpret_cast<uint32_t*>(
            USB_OTG_FS_PERIPH_BASE  + USB_OTG_FIFO_BASE + (i) * USB_OTG_FIFO_SIZE);
    }

    uint8_t lineCoding[7]={
        0x00, 
        0x00,	/* 0x01, */
        0x00, /* 0xC2, */
        0x00, /* 0X0001C200 -= 115200 Kb/s */
        0x00,
        0x00,
        0x00	/* 0x08 */
    };
    

    typedef struct EndPointStruct
    {
        uint16_t statusRx;
        uint16_t statusTx;
    
        uint16_t rxCounter;
        uint16_t txCounter;
        
        uint8_t *rxBufferPtr;
        uint8_t *txBufferPtr;
    } EndPointStruct;
    EndPointStruct EndPoint[EpCount];	/* All the Enpoints are included in this array */

    typedef struct
    {
        uint16_t  wRequest;
        uint16_t  wValue;
        uint16_t  wIndex;
        uint16_t  wLength;
    } USB_setup_req;	/* SETUP packet buffer. Always 8 bytes */

    typedef union
    {
        USB_setup_req setup_pkt;
        uint32_t raw_data[2];
    } USB_setup_req_data;

    uint32_t device_state = DEVICE_STATE_DEFAULT; /* Device state */

    uint32_t sendZlp(uint8_t EPnum)
    {
        epIn(EPnum)->DIEPTSIZ = 1 << USB_OTG_DIEPTSIZ_PKTCNT_Pos   // One Packet
            | 0 << USB_OTG_DIEPTSIZ_XFRSIZ_Pos;          // Zero Length
        epIn(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
    
        while (epIn(EPnum)->DIEPTSIZ);  // Make sure zlp is gone
    
        epOut(EPnum)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
        device_state &= ~DEVICE_STATE_TX_PR;
    
        EndPoint[EPnum].statusTx = EpReady;
        epIn(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
    
        if (isEpStuck(EPnum) == EpOk)
        {
            return EpOk;
        }
        else return EpFailed;
    }
    
    void togglRxEpStatus(uint8_t EPnum, uint8_t param)
    {
        if (EndPoint[EPnum].statusRx == param) return;
        EndPoint[EPnum].statusRx = param;      // Toggle status
    
        if (param == EpReady)
        {
            epOut(EPnum)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;
        }
        else
        {
            epOut(EPnum)->DOEPCTL |= USB_OTG_DOEPCTL_SNAK;
        }
    }
    
    void readFifo(uint8_t dfifo, uint16_t len)
    {
        uint16_t residue = (len % sizeof(uint32_t)) ? 1 : 0;
        uint32_t block_cnt = (len / sizeof(uint32_t)) + residue;
        uint8_t *tmp_ptr = EndPoint[dfifo].rxBufferPtr;
    
        // If unprocessed data length exceeds Max buffer length, it has to be rewritten
        if (dfifo && ((EndPoint[dfifo].rxCounter + len) > RxBufferEp1Size))
        {
            EndPoint[dfifo].rxBufferPtr = rxBufferEp1;
            EndPoint[dfifo].rxCounter = 0;
        }

        uint32_t *ptr = reinterpret_cast<uint32_t *>(EndPoint[dfifo].rxBufferPtr);
        for (uint32_t i = 0; i < block_cnt; i++)
        {
            *ptr++ = *fifo(0);
            printf(" r%08X", *ptr);
        }
    
        if (dfifo > 0)
        {
            epOut(dfifo)->DOEPTSIZ |= DoeptTransferPct << USB_OTG_DOEPTSIZ_PKTCNT_Pos
                | DoeptTransferSize << USB_OTG_DOEPTSIZ_XFRSIZ_Pos;
            epOut(dfifo)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
            EndPoint[dfifo].rxBufferPtr = tmp_ptr + len;
            EndPoint[dfifo].rxCounter = EndPoint[dfifo].rxCounter + len;
        }
    }
    
    uint32_t writeFifo(uint8_t dfifo, uint8_t *src, uint16_t len)
    {
        uint16_t residue = (len % sizeof(uint32_t)) ? 1 : 0;
        uint32_t block_cnt = (len / sizeof(uint32_t)) + residue;
        
        uint32_t *ptr = reinterpret_cast<uint32_t *>(src);
        for (uint32_t i = 0; (i < block_cnt) ; i++)
        {
            printf(" w%08X", *ptr);
            *fifo(dfifo) = *ptr++;
        }

        EndPoint[dfifo].txBufferPtr = EndPoint[dfifo].txBufferPtr + len;
        EndPoint[dfifo].txCounter = EndPoint[dfifo].txCounter - len;

        return 0;
    }
    
    uint32_t transferTxCallback(uint8_t EPnum)
    {
        if (EndPoint[EPnum].statusTx == EpBusy)
        {
            epOut(EPnum)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;	
            return EpFailed;
        }	

        if (!EndPoint[EPnum].txCounter)        // No data in TX Buffer
        {
            if(EndPoint[EPnum].statusTx == EpZlp)
            {			
                if(sendZlp(EPnum) == EpOk)
                {
                    return EpOk;
                }
                else return EpFailed;
            }
            epOut(EPnum)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;	
            device_state &= ~DEVICE_STATE_TX_PR;			
            EndPoint[EPnum].statusTx = EpReady;
            epIn(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
            return EpOk;
        }
    
        uint16_t max_tx_sz = (EPnum==0) ? MaxCdcEp0TxSiz : MaxCdcEp1TxSiz; // Max transfer size considering TX FIFO size

        uint32_t len;
        uint32_t residue;
        uint32_t pct_cnt;
            
        if (EndPoint[EPnum].txCounter < CdcMaxPacketSize)
        {       /* if FIFO size is 64 bytes, but transaction is 67 bytes (DevDescriptor) transaction will be split into two parts: 1 - with 64 bytes length and 2 - with 3 bytes length */
            len = EndPoint[EPnum].txCounter;
            residue = 0;
            pct_cnt = 1;
        }
        else
        {
            len = (EndPoint[EPnum].txCounter > max_tx_sz) ? max_tx_sz : EndPoint[EPnum].txCounter; 
            residue = (len % CdcMaxPacketSize) ? 1 : 0;
            pct_cnt = len / CdcMaxPacketSize + residue;
        }

        EndPoint[EPnum].statusTx = EpBusy;      // Set Busy flag

        epIn(EPnum)->DIEPTSIZ = pct_cnt << USB_OTG_DIEPTSIZ_PKTCNT_Pos
            | len << USB_OTG_DIEPTSIZ_XFRSIZ_Pos;
        epIn(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
        
        writeFifo(EPnum, EndPoint[EPnum].txBufferPtr, len);
        {
            // if ((EPnum == Ep1) && (isEpStuck(Ep1) == EpFailed))       // Recovery Routine EP IN
            // {
            //     epIn(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_EPDIS | USB_OTG_DIEPCTL_SNAK;
            //     epIn(EPnum)->DIEPTSIZ = 0;
            // }
            // epIn(EPnum)->DIEPTSIZ = pct_cnt << USB_OTG_DIEPTSIZ_PKTCNT_Pos
            //     | len << USB_OTG_DIEPTSIZ_XFRSIZ_Pos;
            // epIn(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
            
            // if ((EPnum == Ep1) && (epIn(EPnum)->DTXFSTS >= Ep1MinDtfXstsLvl))  // Check Fifo Free Space
            // {
            //     // flushTxFifo(Ep1, FlushFifoTimeout);
            //     uint32_t count = 0;
            //     _usb->GRSTCTL = USB_OTG_GRSTCTL_TXFFLSH | (1 << USB_OTG_GRSTCTL_TXFNUM_Pos);
            //     do
            //     {
            //         if (++count > FlushFifoTimeout)
            //         {
            //             break;
            //         }
            //     }
            //     while (_usb->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH);
            
            //    return EpOk;

            // }
        }

        if (EndPoint[EPnum].txCounter >= CdcMaxPacketSize)
        {
            if (!EndPoint[EPnum].txCounter && !residue)  // Was this packet of MaxSize the last one in the queue ? Is ZLP required?
            {
                EndPoint[EPnum].statusTx = EpZlp;        // Change EP TX status to ZLP, thereafter ZLP will be sent in sequential function call
                while (isEpStuck(EPnum) != EpOk);
                sendZlp(EPnum);
                return EpOk;
            }
        }
        else
        {
            device_state &= ~DEVICE_STATE_TX_PR;		
        }

