Kozurofu-San/kozurofu-drivers/platforms/STM32F4/UsbDriver.h
            case CdcSetLineCoding:                              // Request 0x2021
                len = 0;		
                break;       
            case CdcSetControlLineState:                        // Request 0x2221
                len = 0;	
                break;	
            case ClearFeatureEndp:                              // Request 0x0201
                return;
            default:
                break;
        } 
        
        setTxBuffer(Ep0, ptr, len);
    }
    
    uint32_t isEpStuck(uint8_t EPnum)
    {
        if ((epIn(EPnum)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)  &&      // EPENA stuck
            !(epIn(EPnum)->DIEPTSIZ & USB_OTG_DIEPTSIZ_XFRSIZ) &&   // No data pending
            (epIn(EPnum)->DIEPTSIZ & USB_OTG_HCTSIZ_PKTCNT))        // Packet count pending
        {
            return EpFailed;
        }
        else return EpOk;
    }
    
    uint8_t rxBufferEp0[RxBufferEp0Size];   // Recieved data is stored here after application reads DFIFO. RX FIFO is shared
    uint8_t rxBufferEp1[RxBufferEp1Size];   // Recieved data is stored here after application reads DFIFO. RX FIFO is shared
    
    USB_setup_req_data setup_pkt_data;      // Setup Packet var

    /* Device string descriptor */
    static constexpr uint8_t deviceDescriptor[DeviceDescriptorLength] = {
        DeviceDescriptorLength,     
        0x01,                       /* Descriptor type - device */
        0x00, 0x02,                 /*  0x0110 = usb 1.1 ; 0x0200 = usb 2.0 */
        0x02,                       /* CDC */
        0x02,                       /*  Abstract Control Model subclass */
        0x00,                       /* protocol */
        Ep0Size,                    /* EP0 size */
        loByte(Vid), hiByte(Vid),   /* VID */
        loByte(Pid), hiByte(Pid),   /* PID */
        0x00,                       /* ver. (BCD) */
        0x02,                       /* ver. (BCD) */	
        0x01,                       /* Manufactor string index */
        0x02,                       /* Product string index */
        0x03,                       /* Serial number string index */
        1                           /* configuration count */
    };

    /* Configuration descriptor */
    static constexpr uint8_t configurationDescriptor[ConfigurationDescriptorLength] = {
        /* Configuration descriptor */
        0x09,                           /* bLength: Configuration Descriptor size */
        0x02,                           /* bDescriptorType: Configuration */
        ConfigurationDescriptorLength,  /* wTotalLength:no of returned bytes */
        0x00,
        0x02,                           /* bNumInterfaces: 2 interface */
        0x01,                           /* bConfigurationValue: Configuration value */
        0x00,                           /* iConfiguration: Index of string descriptor describing the configuration */
        0xC0,                           /* bmAttributes: self powered */
        0x32,                           /* MaxPower 0 mA */

        /*Interface Descriptor */
        0x09,           /* bLength: Interface Descriptor size */
        0x04,           /* bDescriptorType: Interface */
        /* Interface descriptor type */
        0x00,           /* bInterfaceNumber: Number of Interface */
        0x00,           /* bAlternateSetting: Alternate setting */
        0x01,           /* bNumEndpoints: One endpoints used */
        0x02,           /* bInterfaceClass: Communication Interface Class */
        0x02,           /* bInterfaceSubClass: Abstract Control Model */
        0x01,           /* bInterfaceProtocol: Common AT commands */
        0x00,           /* iInterface: */

        /*Header Functional Descriptor*/
        0x05,           /* bLength: Endpoint Descriptor size */
        0x24,           /* bDescriptorType: CS_INTERFACE */
        0x00,           /* bDescriptorSubtype: Header Func Desc */
        0x10,           /* bcdCDC: spec release number */
        0x01,

        /*Call Management Functional Descriptor*/
        0x05,           /* bFunctionLength */
        0x24,           /* bDescriptorType: CS_INTERFACE */
        0x01,           /* bDescriptorSubtype: Call Management Func Desc */
        0x00,           /* bmCapabilities: D0+D1 */
        0x01,           /* bDataInterface: 1 */

        /*ACM Functional Descriptor*/
        0x04,           /* bFunctionLength */
        0x24,           /* bDescriptorType: CS_INTERFACE */
        0x02,           /* bDescriptorSubtype: Abstract Control Management desc */
        0x02,           /* bmCapabilities */

        /*Union Functional Descriptor*/
        0x05,           /* bFunctionLength */
        0x24,           /* bDescriptorType: CS_INTERFACE */
        0x06,           /* bDescriptorSubtype: Union func desc */
        0x00,           /* bMasterInterface: Communication class interface */
        0x01,           /* bSlaveInterface0: Data Class Interface */

        /*Endpoint 2 Descriptor*/
        0x07,           /* bLength: Endpoint Descriptor size */
        0x05,           /* bDescriptorType: Endpoint */
        0x82,           /* bEndpointAddress */
        0x03,           /* bmAttributes: Interrupt */
        loByte(CdcCmdPacketSize), hiByte(CdcCmdPacketSize),    /* wMaxPacketSize: */
        0x10,           /* bInterval: */

        /*Data class interface descriptor*/
        0x09,           /* bLength: Endpoint Descriptor size */
        0x04,           /* bDescriptorType: */
        0x01,           /* bInterfaceNumber: Number of Interface */
        0x00,           /* bAlternateSetting: Alternate setting */
        0x02,           /* bNumEndpoints: Two endpoints used */
        0x0A,           /* bInterfaceClass: CDC */
        0x00,           /* bInterfaceSubClass: */
        0x00,           /* bInterfaceProtocol: */
        0x00,           /* iInterface: */

        /*Endpoint OUT Descriptor*/
        0x07,           /* bLength: Endpoint Descriptor size */
        0x05,           /* bDescriptorType: Endpoint */
        0x01,           /* bEndpointAddress */
        0x02,           /* bmAttributes: Bulk */
        loByte(CdcMaxPacketSize), hiByte(CdcMaxPacketSize),  /* wMaxPacketSize: */
        0x00,           /* bInterval: ignore for Bulk transfer */

