Kozurofu-San/kozurofu-drivers/platforms/STM32F4/UsbDriver.h
        /*Endpoint IN Descriptor*/
        0x07,           /* bLength: Endpoint Descriptor size */
        0x05,           /* bDescriptorType: Endpoint */
        0x81,           /* bEndpointAddress */
        0x02,           /* bmAttributes: Bulk */
        loByte(CdcMaxPacketSize), hiByte(CdcMaxPacketSize), /* wMaxPacketSize: */
        0x00            /* bInterval: ignore for Bulk transfer */
    };

    /* Language string descriptor */
    static constexpr uint8_t languageStringDescriptor[LangDescriptorLength] = {
        LangDescriptorLength,   /* USB_LEN_LANGID_STR_DESC */
        0x03,                   /* USB_DESC_TYPE_STRING */
        loByte(LangIdString),
        hiByte(LangIdString)
    };

    /* Manufactor string descriptor */
    static constexpr uint8_t manufactorStringDescriptor[MfcDescriptorLength] = {
        MfcDescriptorLength,				 
        0x03,	                /* USB_DESC_TYPE_STRING */
        'S', 0x00,
        'T', 0x00, 
        'M', 0x00, 
        'i', 0x00, 
        'c', 0x00, 
        'r', 0x00, 
        'o', 0x00, 
        'e', 0x00, 
        'l', 0x00, 
        'e', 0x00, 
        'c', 0x00, 
        't', 0x00, 
        'r', 0x00, 
        'o', 0x00,			
        'n', 0x00, 
        'i', 0x00, 
        'c', 0x00, 
        's', 0x00
    };

    /* Product string descriptor */
    static constexpr uint8_t productStringDescriptor[ProductDescriptorLength] = {
        ProductDescriptorLength, 
        0x03,                   /* USB_DESC_TYPE_STRING */
        'S', 0x00, 
        'T', 0x00, 
        'M', 0x00, 
        '3', 0x00, 
        '2', 0x00, 
        ' ', 0x00, 
        'V', 0x00, 
        'i', 0x00, 
        'r', 0x00, 
        't', 0x00, 
        'u', 0x00, 
        'a', 0x00, 
        'l', 0x00, 
        ' ', 0x00,
        'C', 0x00, 
        'o', 0x00, 
        'm', 0x00, 
        'P', 0x00, 
        'o', 0x00, 
        'r', 0x00, 
        't', 0x00
    };

    /* Serial number string descriptor */
    static constexpr uint8_t serialNumberStringDescriptor[SerialDescriptorLength] = {
        SerialDescriptorLength,	 
        0x03,               /* USB_DESC_TYPE_STRING */
        0x34, 0x00,
        0x38, 0x00, 
        0x00, 0x00, 
        0x45, 0x00, 
        0x37, 0x00, 
        0x34, 0x00, 
        0x46, 0x00, 
        0x37, 0x00, 
        0x36, 0x00, 
        0x33, 0x00, 
        0x30, 0x00, 
        0x38, 0x00
    };

    /* Device qualifier string descriptor */
    static constexpr uint8_t deviceQualifierDescriptor[DeviceQualifierLength] = {
        DeviceQualifierLength,
        0x06,               /* Device Qualifier */
        0x00,
        0x02,
        0x00,
        0x00,
        0x00,
        0x40,
        0x01,
        0x00
    };

    static constexpr uint8_t stringInterface[InterfaceStringLength] = {
        InterfaceStringLength, 
        0x03,               /* USB_DESC_TYPE_STRING */
        'C', 0x00, 
        'D', 0x00, 
        'C', 0x00, 
        ' ', 0x00, 
        'I', 0x00, 
        'n', 0x00, 
        't', 0x00, 
        'e', 0x00, 
        'r', 0x00, 
        'f', 0x00, 
        'a', 0x00, 
        'c', 0x00, 
        'e', 0x00
    };

    static constexpr uint8_t configurationStringDescriptor[ConfigStringLength] = {
        ConfigStringLength, 
        0x03,               /* USB_DESC_TYPE_STRING */
        'C', 0x00, 
        'D', 0x00, 
        'C', 0x00, 
        ' ', 0x00, 
        'C', 0x00, 
        'o', 0x00, 
        'n', 0x00, 
        'f', 0x00, 
        'i', 0x00, 
        'g', 0x00
    };

};
}